In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.read_csv('titanic_original.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [3]:
df.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [4]:
df.isnull().sum()

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

# Fill the missing age values with mean

In [5]:
df['age']

0       29.0000
1        0.9167
2        2.0000
3       30.0000
4       25.0000
5       48.0000
6       63.0000
7       39.0000
8       53.0000
9       71.0000
10      47.0000
11      18.0000
12      24.0000
13      26.0000
14      80.0000
15          NaN
16      24.0000
17      50.0000
18      32.0000
19      36.0000
20      37.0000
21      47.0000
22      26.0000
23      42.0000
24      29.0000
25      25.0000
26      25.0000
27      19.0000
28      35.0000
29      28.0000
         ...
1280    22.0000
1281    22.0000
1282        NaN
1283        NaN
1284        NaN
1285    32.5000
1286    38.0000
1287    51.0000
1288    18.0000
1289    21.0000
1290    47.0000
1291        NaN
1292        NaN
1293        NaN
1294    28.5000
1295    21.0000
1296    27.0000
1297        NaN
1298    36.0000
1299    27.0000
1300    15.0000
1301    45.5000
1302        NaN
1303        NaN
1304    14.5000
1305        NaN
1306    26.5000
1307    27.0000
1308    29.0000
1309        NaN
Name: age, Length: 1310, dtype: float64

In [6]:
df_with_age_mean = df.age.fillna(df['age'].mean())

In [7]:
df_with_age_mean

0       29.000000
1        0.916700
2        2.000000
3       30.000000
4       25.000000
5       48.000000
6       63.000000
7       39.000000
8       53.000000
9       71.000000
10      47.000000
11      18.000000
12      24.000000
13      26.000000
14      80.000000
15      29.881135
16      24.000000
17      50.000000
18      32.000000
19      36.000000
20      37.000000
21      47.000000
22      26.000000
23      42.000000
24      29.000000
25      25.000000
26      25.000000
27      19.000000
28      35.000000
29      28.000000
          ...
1280    22.000000
1281    22.000000
1282    29.881135
1283    29.881135
1284    29.881135
1285    32.500000
1286    38.000000
1287    51.000000
1288    18.000000
1289    21.000000
1290    47.000000
1291    29.881135
1292    29.881135
1293    29.881135
1294    28.500000
1295    21.000000
1296    27.000000
1297    29.881135
1298    36.000000
1299    27.000000
1300    15.000000
1301    45.500000
1302    29.881135
1303    29.881135
1304    14.500000
1305    29.881135
1306    26.500000
1307    27.000000
1308    29.000000
1309    29.881135
Name: age, Length: 1310, dtype: float64

In [8]:
df.isnull().sum()

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

In [9]:
df_with_age_mean.isnull().sum()

0

In [10]:
df.shape

(1310, 14)

In [11]:
df_drop = df.dropna()
df_drop.shape

(0, 14)

In [12]:
df_with_condition = df.dropna(how='any', thresh=4)
df_with_condition.shape

(1309, 14)

In [13]:
df_with_condition.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [14]:
df.drop('name', axis=1, inplace=True)
df.head()

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [15]:
df.shape

(1310, 13)

In [19]:
df.duplicated('cabin')

0       False
1       False
2        True
3        True
4        True
5       False
6       False
7       False
8       False
9       False
10      False
11       True
12      False
13       True
14      False
15       True
16      False
17       True
18      False
19      False
20      False
21       True
22      False
23       True
24      False
25       True
26      False
27       True
28      False
29      False
        ...
1280     True
1281     True
1282     True
1283     True
1284     True
1285     True
1286     True
1287     True
1288     True
1289     True
1290     True
1291     True
1292     True
1293     True
1294     True
1295     True
1296     True
1297     True
1298     True
1299     True
1300     True
1301     True
1302     True
1303     True
1304     True
1305     True
1306     True
1307     True
1308     True
1309     True
Length: 1310, dtype: bool

In [20]:
df.shape

(1310, 13)

In [23]:
df_drop_dup = df.drop_duplicates()
df_drop_dup.shape

(1289, 13)

In [24]:
df.dtypes

pclass       float64
survived     float64
sex           object
age          float64
sibsp        float64
parch        float64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [25]:
df.pclass.dtypes

dtype('float64')

In [28]:
df.age.astype(float).dtypes

dtype('float64')

In [29]:
df.tail()

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1305,3.0,0.0,female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,male,26.5,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,male,27.0,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,male,29.0,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [34]:
df = df.dropna(how='all')

In [35]:
df.tail()

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1304,3.0,0.0,female,14.5,1.0,0.0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3.0,0.0,female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,male,26.5,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,male,27.0,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,male,29.0,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [36]:
import zipfile as zp

In [37]:
archive = zp.ZipFile('titanic_original.csv.zip', 'r')

In [43]:
df_zip = archive.read('titanic_original.csv')

In [45]:
txt_file = open('housing.txt', 'r')
txt_file.read()

'1. Title: Boston Housing Data\n\n2. Sources:\n   (a) Origin:  This dataset was taken from the StatLib library which is\n                maintained at Carnegie Mellon University.\n   (b) Creator:  Harrison, D. and Rubinfeld, D.L. \'Hedonic prices and the \n                 demand for clean air\', J. Environ. Economics & Management,\n                 vol.5, 81-102, 1978.\n   (c) Date: July 7, 1993\n\n3. Past Usage:\n   -   Used in Belsley, Kuh & Welsch, \'Regression diagnostics ...\', Wiley, \n       1980.   N.B. Various transformations are used in the table on\n       pages 244-261.\n    -  Quinlan,R. (1993). Combining Instance-Based and Model-Based Learning.\n       In Proceedings on the Tenth International Conference of Machine \n       Learning, 236-243, University of Massachusetts, Amherst. Morgan\n       Kaufmann.\n\n4. Relevant Information:\n\n   Concerns housing values in suburbs of Boston.\n\n5. Number of Instances: 506\n\n6. Number of Attributes: 13 continuous attributes (including "class"\n                         attribute "MEDV"), 1 binary-valued attribute.\n\n7. Attribute Information:\n\n    1. CRIM      per capita crime rate by town\n    2. ZN        proportion of residential land zoned for lots over \n                 25,000 sq.ft.\n    3. INDUS     proportion of non-retail business acres per town\n    4. CHAS      Charles River dummy variable (= 1 if tract bounds \n                 river; 0 otherwise)\n    5. NOX       nitric oxides concentration (parts per 10 million)\n    6. RM        average number of rooms per dwelling\n    7. AGE       proportion of owner-occupied units built prior to 1940\n    8. DIS       weighted distances to five Boston employment centres\n    9. RAD       index of accessibility to radial highways\n    10. TAX      full-value property-tax rate per $10,000\n    11. PTRATIO  pupil-teacher ratio by town\n    12. B        1000(Bk - 0.63)^2 where Bk is the proportion of blacks \n                 by town\n    13. LSTAT    % lower status of the population\n    14. MEDV     Median value of owner-occupied homes in $1000\'s\n\n8. Missing Attribute Values:  None.'

In [51]:
df_json = pd.read_json('exercise-data.json')
df_json.tail()

,__v,_id,author,date,isPublished,name,price,tags
2,0,5a68fde3f09ad7646ddec17e,Mosh,2018-01-24 21:42:59.605,True,ASP.NET MVC Course,15.0,"[aspnet, backend]"
3,0,5a68fdf95db93f6477053ddd,Mosh,2018-01-24 21:43:21.589,False,React Course,NaN,"[react, frontend]"
4,0,5a68fe2142ae6a6482c4c9cb,Jack,2018-01-24 21:44:01.075,True,Node.js Course by Jack,12.0,"[node, backend]"
5,0,5a68ff090c553064a218a547,Mary,2018-01-24 21:47:53.128,False,Node.js Course by Mary,12.0,"[node, backend]"
6,0,5a6900fff467be65019a9001,Mosh,2018-01-24 21:56:15.353,True,Angular Course,15.0,"[angular, frontend]"

In [52]:
import json

In [53]:
with open('exercise-data.json', 'r') as jsd:
    df_json_data = json.load(jsd)
    print(df_json_data)

[{'_id': '5a68fdc3615eda645bc6bdec', 'tags': ['express', 'backend'], 'date': '2018-01-24T21:42:27.388Z', 'name': 'Express.js Course', 'author': 'Mosh', 'isPublished': True, 'price': 10, '__v': 0}, {'_id': '5a68fdd7bee8ea64649c2777', 'tags': ['node', 'backend'], 'date': '2018-01-24T21:42:47.912Z', 'name': 'Node.js Course', 'author': 'Mosh', 'isPublished': True, 'price': 20, '__v': 0}, {'_id': '5a68fde3f09ad7646ddec17e', 'tags': ['aspnet', 'backend'], 'date': '2018-01-24T21:42:59.605Z', 'name': 'ASP.NET MVC Course', 'author': 'Mosh', 'isPublished': True, 'price': 15, '__v': 0}, {'_id': '5a68fdf95db93f6477053ddd', 'tags': ['react', 'frontend'], 'date': '2018-01-24T21:43:21.589Z', 'name': 'React Course', 'author': 'Mosh', 'isPublished': False, '__v': 0}, {'_id': '5a68fe2142ae6a6482c4c9cb', 'tags': ['node', 'backend'], 'date': '2018-01-24T21:44:01.075Z', 'name': 'Node.js Course by Jack', 'author': 'Jack', 'isPublished': True, 'price': 12, '__v': 0}, {'_id': '5a68ff090c553064a218a547', 'tags': ['node', 'backend'], 'date': '2018-01-24T21:47:53.128Z', 'name': 'Node.js Course by Mary', 'author': 'Mary', 'isPublished': False, 'price': 12, '__v': 0}, {'_id': '5a6900fff467be65019a9001', 'tags': ['angular', 'frontend'], 'date': '2018-01-24T21:56:15.353Z', 'name': 'Angular Course', 'author': 'Mosh', 'isPublished': True, 'price': 15, '__v': 0}]

In [54]:
df_json_data

[{'_id': '5a68fdc3615eda645bc6bdec',
  'tags': ['express', 'backend'],
  'date': '2018-01-24T21:42:27.388Z',
  'name': 'Express.js Course',
  'author': 'Mosh',
  'isPublished': True,
  'price': 10,
  '__v': 0},
 {'_id': '5a68fdd7bee8ea64649c2777',
  'tags': ['node', 'backend'],
  'date': '2018-01-24T21:42:47.912Z',
  'name': 'Node.js Course',
  'author': 'Mosh',
  'isPublished': True,
  'price': 20,
  '__v': 0},
 {'_id': '5a68fde3f09ad7646ddec17e',
  'tags': ['aspnet', 'backend'],
  'date': '2018-01-24T21:42:59.605Z',
  'name': 'ASP.NET MVC Course',
  'author': 'Mosh',
  'isPublished': True,
  'price': 15,
  '__v': 0},
 {'_id': '5a68fdf95db93f6477053ddd',
  'tags': ['react', 'frontend'],
  'date': '2018-01-24T21:43:21.589Z',
  'name': 'React Course',
  'author': 'Mosh',
  'isPublished': False,
  '__v': 0},
 {'_id': '5a68fe2142ae6a6482c4c9cb',
  'tags': ['node', 'backend'],
  'date': '2018-01-24T21:44:01.075Z',
  'name': 'Node.js Course by Jack',
  'author': 'Jack',
  'isPublished': True,
  'price': 12,
  '__v': 0},
 {'_id': '5a68ff090c553064a218a547',
  'tags': ['node', 'backend'],
  'date': '2018-01-24T21:47:53.128Z',
  'name': 'Node.js Course by Mary',
  'author': 'Mary',
  'isPublished': False,
  'price': 12,
  '__v': 0},
 {'_id': '5a6900fff467be65019a9001',
  'tags': ['angular', 'frontend'],
  'date': '2018-01-24T21:56:15.353Z',
  'name': 'Angular Course',
  'author': 'Mosh',
  'isPublished': True,
  'price': 15,
  '__v': 0}]